[
{
	"name": "algorithm",
	"definition": "A sequence of steps to solve a problem.  The word is most often used in reference to algorithms used to make computer software but it is correct to call any sequence of steps for solving any problem an 'algorithm'.",
	"examples": [
		"A <strong>recipe</strong>.  The problem would be needing the food or drink.",
		"A <strong>sequence of steps for creating a flag</strong>.  The problem would be that we need to make a flag.  WebLogo has many examples drawing flags.  Some link to construction sheets that express the drawing algorithm with more English or using diagrams.",
		"A <strong>sequence of instructions for drawing a picture</strong>.  The problem would be needing the picture.  Paint by number and string art templates are some more specific examples.",
		"A <strong>route or travel plan</strong>.  In other words, a sequence of turns for going from one place to another.",
		"<strong>Musical notes</strong>.  The problem would be wanting to play or hear music or help others play the same song.  In other words, instructions on time, duration, and sequence to play or sing different pitches.  MIDI files are essentially a digital equivalent to musical notes which are played by simulated instruments.",
		"A <strong>plan</strong>.  The problem would be wanting to reach the goal of the plan.",
		"A <strong>procedure</strong>.  The problem would be the goal of the procedure."
	]
},
{
	"name": "command",
	"definition": "An instruction that is predefined.  A command is like a procedure except a command is not implemented in WebLogo code.  A command is defined as part of the Logo interpreter.  Documentation from other Logo interpreters sometimes refers to commands as 'primitives'.",
	"examples": [
		"setPenSize",
		"forward",
		"modulo"
	],
	"searchKeywords": ["procedure"]
},
{
	"name": "frame",
	"definitionHTML": "<p>An animation frame is like one of many images used to define a video/animation.</p><p>To give a more polished looking video, a single frame can be made from many snapshots.  Making a frame from many snapshots can also simulate motion blur and help you see motion despite having a static image.  While an animation often spans several seconds of time.  A frame often spans a tiny fraction of a second akin to the shutter speed or exposure length of a camera.</p>",
	"examples": [],
	"searchKeywords": ["animation"]
},
{
	"name": "polar coordinates",
	"definitionHTML": "<p>Polar coordinates are a way of describing a location in terms of a distance and a direction.  If you have a distance and direction, in WebLogo, you could go to it by setting the heading(<span class=\"command\">setHeading</span>) to that direction and <span class=\"command\">jumpForward</span> the distance.</p><p>Polar coordinates are an alternative to x-y coordinates.  You can learn more about polar coordinates on <a href=\"https://en.wikipedia.org/wiki/Polar_coordinate_system\" target=\"_empty\">wikipedia</a>.</p>"
},
{
	"name": "procedure",
	"searchKeywords": ["command"],
	"definition": "A procedure is a named sequence of steps for solving a problem in WebLogo.  A procedure is like a command except that a procedure is defined by WebLogo code that you can edit.  In other words, a procedure is like a customizable command."
},
{
	"name": "recursion",
	"searchKeywords": ["loop", "recursive"],
	"definition": "A technique for repeating instructions that involves a procedure calling itself.  The simplest and most recognizable form of recursion is where a procedure calls itself directly.  If a procedure calls other procedures that then call the first procedure, you'll have indirect recursion."
},
{
	"name": "snapshot",
	"definitionHTML": "<p>An animation snapshot is an image that visualizes an instant in an animation.</p><p>A snapshot is very much like a frame except that a snapshot is never motion blurred or represents even a very small span of time.  If you made an animation of a gun firing at realistic speeds, a snapshot would shot a perfectly sharp bullet but a frame made from a huge number of snapshots would show a streak along the path of the bullet.</p>",
	"examples": [],
	"searchKeywords": ["animation", "frame"]
}
]